data/NASA_2DWMH_sweep_pass5/pass5_gridfit_sa_800/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
196800
(
(-1.34673893669 0.000114653137025 -4.10245886926e-20)
(-1.34021262601 0.000114653137025 3.89761675413e-19)
(-1.33367794178 0.000114653137025 1.92961592581e-20)
(-1.32713487329 0.000114653137025 3.02995384996e-19)
(-1.32058340976 0.000114653137025 2.12415927078e-19)
(-1.31402354043 0.000114653137025 -1.00766103142e-20)
(-1.30745525451 0.000114653137025 1.87356168472e-19)
(-1.3008785412 0.000114653137025 6.04708115263e-19)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
240
(
(-1.35 0.000114653137025 -1.11650583379e-19)
(-1.35 0.000345405568936 -2.51947780313e-20)
(-1.35 0.000579068557432 -1.59317469557e-20)
(-1.35 0.000815678814326 -4.39589745418e-20)
(-1.35 0.00105527351448 -3.46944695195e-20)
(-1.35 0.00129789030168 -9.79404574418e-20)
(-1.35 0.00154356729449 9.95920342079e-22)
(-1.35 0.00179234309229 6.22315428126e-20)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
240
(
(0.84 0.000114653137025 1.11650583379e-19)
(0.84 0.000345405568936 2.51947780313e-20)
(0.84 0.000579068557432 1.59317469557e-20)
(0.84 0.000815678814326 4.39589745418e-20)
(0.84 0.00105527351448 3.46944695195e-20)
(0.84 0.00129789030168 9.79404574418e-20)
(0.84 0.00154356729449 -9.95920342079e-22)
(0.84 0.00179234309229 -6.22315428126e-20)
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
820
(
(-1.34673893669 0 -3.02408650656e-20)
(-1.340212626 0 -8.54028155147e-21)
(-1.33367794178 0 -7.32539058432e-20)
(-1.32713487329 0 -1.05458596173e-19)
(-1.32058340976 0 -9.45118139093e-20)
(-1.31402354043 0 -2.9825889981e-20)
(-1.30745525451 0 8.83925387595e-20)
(-1.3008785412 0 7.75978780989e-20)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
820
(
(-1.34673893669 0.35 3.02408650656e-20)
(-1.34021262601 0.35 8.54028155147e-21)
(-1.33367794178 0.35 7.32539058432e-20)
(-1.32713487329 0.35 1.05458596173e-19)
(-1.32058340976 0.35 9.45118139093e-20)
(-1.31402354043 0.35 2.9825889981e-20)
(-1.30745525451 0.35 -8.83925387595e-20)
(-1.3008785412 0.35 -7.75978780989e-20)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
