data/NASA_2DWMH_sweep_pass5/pass5_gridfit_sa_800/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
196800
(
-1.34673893669
-1.34021262601
-1.33367794178
-1.32713487329
-1.32058340976
-1.31402354043
-1.30745525451
-1.3008785412
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
240
(
-1.35
-1.35
-1.35
-1.35
-1.35
-1.35
-1.35
-1.35
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
240
(
0.84
0.84
0.84
0.84
0.84
0.84
0.84
0.84
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
820
(
-1.34673893669
-1.340212626
-1.33367794178
-1.32713487329
-1.32058340976
-1.31402354043
-1.30745525451
-1.3008785412
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
820
(
-1.34673893669
-1.34021262601
-1.33367794178
-1.32713487329
-1.32058340976
-1.31402354043
-1.30745525451
-1.3008785412
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
