data/NASA_2DWMH_sweep_pass5/pass5_gridfit_sa_800/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
196800
(
0.000114653137025
0.000114653137025
0.000114653137025
0.000114653137025
0.000114653137025
0.000114653137025
0.000114653137025
0.000114653137025
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
240
(
0.000114653137025
0.000345405568936
0.000579068557432
0.000815678814326
0.00105527351448
0.00129789030168
0.00154356729449
0.00179234309229
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
240
(
0.000114653137025
0.000345405568936
0.000579068557432
0.000815678814326
0.00105527351448
0.00129789030168
0.00154356729449
0.00179234309229
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
820
(
0
0
0
0
0
0
0
0
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
820
(
0.35
0.35
0.35
0.35
0.35
0.35
0.35
0.35
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
