data/NASA_2DWMH_sweep_pass5/pass5_gridfit_sa_800/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
196800
(
-4.10245886926e-20
3.89761675413e-19
1.92961592581e-20
3.02995384996e-19
2.12415927078e-19
-1.00766103142e-20
1.87356168472e-19
6.04708115263e-19
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
240
(
-1.11650583379e-19
-2.51947780313e-20
-1.59317469557e-20
-4.39589745418e-20
-3.46944695195e-20
-9.79404574418e-20
9.95920342079e-22
6.22315428126e-20
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
240
(
1.11650583379e-19
2.51947780313e-20
1.59317469557e-20
4.39589745418e-20
3.46944695195e-20
9.79404574418e-20
-9.95920342079e-22
-6.22315428126e-20
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
820
(
-3.02408650656e-20
-8.54028155147e-21
-7.32539058432e-20
-1.05458596173e-19
-9.45118139093e-20
-2.9825889981e-20
8.83925387595e-20
7.75978780989e-20
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
820
(
3.02408650656e-20
8.54028155147e-21
7.32539058432e-20
1.05458596173e-19
9.45118139093e-20
2.9825889981e-20
-8.83925387595e-20
-7.75978780989e-20
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
