data/NASA_2DWMH_sweep_pass5/pass5_gridfit_sa_800/constant/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "constant";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
93600
(
0.000219075361732
0.000219056116938
0.000219048419815
0.000219045551885
0.000219045877049
0.000219049479624
0.000219051661634
0.000219051661643
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
0.000219052123178
0.000660218491424
0.00110755190875
0.0015611385841
0.00202106593157
0.00248742258719
0.00296029842602
0.00343978457949
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
0.000219052123178
0.000660218491424
0.00110755190875
0.00156113858411
0.00202106593157
0.00248742258719
0.00296029842602
0.00343978457949
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
520
(
0
0
0
0
0
0
0
0
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
520
(
0.35
0.35
0.35
0.35
0.35
0.35
0.35
0.35
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
